refine orchastration flow
